src/cf/InformationRegisters/СвязиПоказателейБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СвязиПоказателейБюджета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПоказательБизнеса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиБизнеса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязанныйПоказательБизнеса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиБизнеса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыПоказателейБизнеса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПоказателейБизнеса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Группа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Формула</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/СвязиПоказателейБюджета/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПоказательБизнеса") Тогда
		ПоказательБизнеса = Параметры.ПоказательБизнеса;
		Список.Параметры.УстановитьЗначениеПараметра("ПоказательБизнеса", ПоказательБизнеса);
		Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьВсе",Ложь);
		
		ТипПоказателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПоказательБизнеса, "ТипПоказателя");
		Если ТипПоказателя = Перечисления.ТипыПоказателейБизнеса.Группа
			ИЛИ ТипПоказателя = Перечисления.ТипыПоказателейБизнеса.Формула Тогда
			
			ТолькоПросмотр = Истина;
			Элементы.ДекорацияПредупреждение.Видимость = Истина;
			Элементы.Список.Видимость = Ложь;
			Элементы.ФормаКоманднаяПанель.Видимость = Ложь;
			
		КонецЕсли;
		
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ПоказательБизнеса",Справочники.ПоказателиБизнеса.ПустаяСсылка());
		Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьВсе",Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ПараметрыФормы = Новый Структура("ПоказательБизнеса", ПоказательБизнеса);
	ОткрытьФорму("РегистрСведений.СвязиПоказателейБюджета.ФормаЗаписи", ПараметрыФормы);
КонецПроцедуры


#КонецОбласти
